Documents/ПроизводствоЗаСмену.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>ПроизводствоЗаСмену</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СебестоимостьНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачальникСмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаРабочейСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеализованнаяПродукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗатраченныеМатериалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СотрудникиСмены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМатериалов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/СебестоимостьНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<AccumulationRegister>
		<Properties>
			<Name>СебестоимостьНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПроизводствоЗаСмену/Ext/ObjectModule.bsl
// переменные для записи себестоимости
Перем РеализованныйПродкут;
Перем КоличествоПродукции;

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ТЧСотрудники = СотрудникиСмены;
	Если РаботаСДокументамиНаСервере.ПроверкаКоллизийТабличнойЧасти(ТЧСотрудники) = Истина Тогда
		Сообщить("в табличной части Сотрудники смены имеются повторяющиеся записи. Проведение невозможно");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрокаРеализованнаяПродукция Из РеализованнаяПродукция Цикл
		// регистр ОстаткиМатериалов Приход
		Движения.ОстаткиМатериалов.Записывать = Истина;
		
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаРеализованнаяПродукция.Номенклатура;
		Движение.Склад = Цех;
		Движение.Количество = ТекСтрокаРеализованнаяПродукция.Количество;
		
		РеализованныйПродкут = ТекСтрокаРеализованнаяПродукция.Номенклатура;
		КоличествоПродукции = ТекСтрокаРеализованнаяПродукция.Количество;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СебестоимостьНоменклатурыОстатки.Номенклатура КАК Номенклатура,
	|	СебестоимостьНоменклатурыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	СебестоимостьНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.СебестоимостьНоменклатуры.Остатки(
	|			&МоментВремени,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ПроизводствоЗаСменуЗатраченныеМатериалы.Номенклатура КАК Номенклатура
	|				ИЗ
	|					Документ.ПроизводствоЗаСмену.ЗатраченныеМатериалы КАК ПроизводствоЗаСменуЗатраченныеМатериалы
	|				ГДЕ
	|					ПроизводствоЗаСменуЗатраченныеМатериалы.Ссылка = &Ссылка)) КАК СебестоимостьНоменклатурыОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивОстатков = Запрос.Выполнить().Выгрузить();
	
	ОбщаяСебестоимостьИзготовления = 0;
	
	Для Каждого ТекСтрокаЗатраченныеМатериалы Из ЗатраченныеМатериалы Цикл
		
		// регистр ОстаткиМатериалов Расход
		Движения.ОстаткиМатериалов.Записывать = Истина;
		
		Движение = Движения.ОстаткиМатериалов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаЗатраченныеМатериалы.Номенклатура;
		Движение.Склад = Цех;
		Движение.Количество = ТекСтрокаЗатраченныеМатериалы.Количество;
		
		// расчет себестоимости производства одной единицы продукции.
		Для Каждого СтрокаТЧ ИЗ МассивОстатков Цикл
			Если СтрокаТЧ.Номенклатура = ТекСтрокаЗатраченныеМатериалы.Номенклатура Тогда 
				СебестоимостьИзготовленияЕдиницыПродукта = СтрокаТЧ.СуммаОстаток/СтрокаТЧ.КоличествоОстаток;
			КонецЕсли;
		КонецЦикла;
		
		СебестоимостьИзготовленияПоОдномуМатериалу = СебестоимостьИзготовленияЕдиницыПродукта * ТекСтрокаЗатраченныеМатериалы.Количество;
		ОбщаяСебестоимостьИзготовления = ОбщаяСебестоимостьИзготовления + СебестоимостьИзготовленияПоОдномуМатериалу;		
		
	КонецЦикла;
	
	// регистр СебестоимостьНоменклатуры Приход
	Движения.СебестоимостьНоменклатуры.Записывать = Истина;
	
	Движение = Движения.СебестоимостьНоменклатуры.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Номенклатура = РеализованныйПродкут;
	Движение.Количество = КоличествоПродукции;
	Движение.Сумма = ОбщаяСебестоимостьИзготовления;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиМатериаловОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиМатериаловОстатки.Склад КАК Склад,
	|	-ОстаткиМатериаловОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиМатериалов.Остатки(, Склад = &Склад) КАК ОстаткиМатериаловОстатки
	|ГДЕ
	|	ОстаткиМатериаловОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("Склад", Цех);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("Проведение невозможно, не хватает позиций по номенклатуре: " + ВыборкаДетальныеЗаписи.Номенклатура + " в количистве " + ВыборкаДетальныеЗаписи.Количество );
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
